// 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
{
	const a = [1, 2, 3];
	const b = [4, 5, 6];
	const c = a.concat(b);
	console.log('-------1--------');
	console.log(c);
}
// 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
{
	const a = [1, 2, 3];
	const b = a.reverse();
	console.log("-------2--------");
	console.log(b);
}
// 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
{
	const a = [1, 2, 3];
	a.push(4, 5, 6);
	console.log("-------3--------");
	console.log(a);
}
// 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
{
	const a = [1, 2, 3];
	a.unshift(4, 5, 6);
	console.log("-------4--------");
	console.log(a);
}
// 5. Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
{
	const a = ['js', 'css', 'jq'];
	const b = a.slice(0, 1);
	console.log("-------5--------");
	console.log(b);
}
// 6. Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
{
	const a = ['js', 'css', 'jq'];
	const b = a.slice(-1);
	const c = a.slice(2, 3)
	console.log("-------6--------");
	console.log(b);
	console.log(c);
}
// 7. Дан массив  С помощью метода запишите в новый массив элементы [1, 2, 3].
{
	const a = [1, 2, 3, 4, 5];
	const b = a.slice(0, 3);
	console.log("-------7--------");
	console.log(b);
}
// 8. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [4, 5].
{
	const a = [1, 2, 3, 4, 5];
	const b = a.slice(3, 5);
	console.log("-------8--------");
	console.log(b);
}
// 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода преобразуйте массив в [1, 4, 5].
{
	const a = [1, 2, 3, 4, 5];
	a.splice(1, 2);
	console.log("-------9--------");
	console.log(a);
}
// 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [2, 3, 4].
{
	const a = [1, 2, 3, 4, 5];
	const b = a.splice(1, 3);
	console.log("-------10--------");
	console.log(b);
}
// 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
{
	const a = [1, 2, 3, 4, 5];
	a.splice(3, 0, 'a', 'b', 'c');
	console.log("-------11--------");
	console.log(a);
}
// 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
{
	const a = [1, 2, 3, 4, 5];
	a.splice(1, 4, 'a', 'b', 2, 3, 4, 'c', 5, 'e');
	console.log("-------12--------");
	console.log(a);
}
// 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его
{
	const a = [3, 4, 1, 2, 7];
	a.sort((a, b) => a - b);
	console.log("-------13--------");
	console.log(a);
}
// 14. Дан массив с числами [5, 6, 7, 8, 9]. Найдите сумму этих чисел.
{
	const a = [5, 6, 7, 8, 9];
	const sum = a.reduce((acc, item) => acc += item);
	console.log("-------14--------");
	console.log(sum);
}
// 15. Дан массив с числами [5, 6, 7, 8, 9]. Сделайте из него массив, состоящий из квадратов этих чисел.
{
	const a = [5, 6, 7, 8, 9];
	const p = a.map((item) => item ** 2);
	console.log("-------15--------");
	console.log(p);
}
// 16. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только отрицательные числа.
{
	const a = [1, -3, 5, 6, -7, 8, 9, -11];
	const p = a.filter((item) => item < 0);
	console.log("-------16--------");
	console.log(p);
}
// 17. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только четные числа.
{
	const a = [1, -3, 5, 6, -7, 8, 9, -11];
	const p = a.filter((item) => item % 2 === 0);
	console.log("-------17--------");
	console.log(p);
}
// 18. Дан массив со строками ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az']. 
// Оставьте в нем только те строки, длина которых больше 5-ти символов.
{
	const a = ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az'];
	const p = a.filter((item) => item.length > 5);
	console.log("-------18--------");
	console.log(p);
}
// 19. Дан массив, в нем могут быть обычные элементы и подмассивы, например 
// [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только подмассивы.
{
	const a = [1, 2, [3, 4], 5, [6, 7]];
	const p = a.filter((item) => Array.isArray(item));
	console.log("-------19--------");
	console.log(p);
}
// 20. Дан массив с числами [5,-3, 6,-5, 0,-7, 8, 9]. Посчитайте количество отрицательных чисел в этом массиве.
{
	const a = [5, -3, 6, -5, 0, -7, 8, 9];
	let i = 0;
	a.forEach((item) => {
		if (item < 0) i++
		return i
	});
	console.log("-------20--------");
	console.log(i);
}

